# SQL Practice

## Revising the Select Query I

Query all columns for all American cities in the ```CITY``` table with populations larger than 100000. The ```CountryCode``` for America is USA.

The ```CITY``` table is described as follows:

Query all columns for all American cities in the CITY table with populations larger than 100000. The CountryCode for America is USA.

The CITY table is described as follows:

| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| NAME | VARCHAR(17) |
| COUNTRYCODE | VARCHAR(3) |
| DISTRICT | VARCHAR(20) |
| POPULATION | NUMBER |

**ANSWER:**

```SELECT * 
FROM CITY
WHERE COUNTRYCODE = "USA"
AND POPULATION > 100000;```

## Revising the Select Query II

Query the ```NAME``` field for all American cities in the ```CITY``` table with populations larger than 120000. The ```CountryCode``` for America is USA.

The CITY table is described as follows:

| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| NAME | VARCHAR(17) |
| COUNTRYCODE | VARCHAR(3) |
| DISTRICT | VARCHAR(20) |
| POPULATION | NUMBER |

**ANSWER:**

```SELECT NAME
FROM CITY
WHERE COUNTRYCODE = "USA"
AND POPULATION > 120000;```

## Select All

Query all columns (attributes) for every row in the ``CITY`` table.

The ```CITY``` table is described as follows:

| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| NAME | VARCHAR(17) |
| COUNTRYCODE | VARCHAR(3) |
| DISTRICT | VARCHAR(20) |
| POPULATION | NUMBER |

**ANSWER:**

```SELECT *
FROM CITY;```

## Select By ID

Query all columns for a city in ```CITY``` with the ID 1661.

The ```CITY``` table is described as follows:

| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| NAME | VARCHAR(17) |
| COUNTRYCODE | VARCHAR(3) |
| DISTRICT | VARCHAR(20) |
| POPULATION | NUMBER |

***ANSWER:***

```SELECT *
FROM CITY
WHERE ID = 1661;```

## Japanese Cities' Attributes

Query all attributes of every Japanese city in the ```CITY``` table. The ```COUNTRYCODE``` for Japan is JPN.

| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| NAME | VARCHAR(17) |
| COUNTRYCODE | VARCHAR(3) |
| DISTRICT | VARCHAR(20) |
| POPULATION | NUMBER |

**ANSWER:**

``` SELECT *
FROM CITY
WHERE COUNTRYCODE = "JPN";```

## Japanese Cities' Names

Query the names of all the Japanese cities in the ```CITY``` table. The ```COUNTRYCODE``` for Japan is JPN.

The ```CITY``` table is described as follows:
    
| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| NAME | VARCHAR(17) |
| COUNTRYCODE | VARCHAR(3) |
| DISTRICT | VARCHAR(20) |
| POPULATION | NUMBER |

**ANSWER:**

```SELECT NAME
FROM CITY
WHERE COUNTRYCODE = "JPN";```

## Weather Observation Station 1

Query a list of ```CITY``` and ```STATE``` from the ```STATION``` table.

The STATION table is described as follows:

| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| CITY | VARCHAR(21) |
| STATE | VARCHAR(2) |
| LAT_N | NUMBER |
| LAT_W | NUMBER |

where ```LAT_N``` is the northern latitude and ```LONG_W```  is the western longitude.

**ANSWER:**

```SELECT CITY,
STATE
FROM STATION;```

## Weather Observation Station 2

Query the following two values from the STATION table:

1. The sum of all values in LAT_N rounded to a scale of  decimal places.
2. The sum of all values in LONG_W rounded to a scale of  decimal places.


The STATION table is described as follows:

| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| CITY | VARCHAR(21) |
| STATE | VARCHAR(2) |
| LAT_N | NUMBER |
| LAT_W | NUMBER |

where ```LAT_N``` is the northern latitude and ```LONG_W```  is the western longitude.

ANSWER:

```SELECT ROUND(SUM(LAT_N), 2),
ROUND(SUM(LONG_W), 2)
FROM STATION;```|

## Weather Observation Station 3

Query a list of ```CITY``` names from ```STATION``` for cities that have an even ```ID``` number. Print the results in any order, but exclude duplicates from the answer.
The STATION table is described as follows:

| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| CITY | VARCHAR(21) |
| STATE | VARCHAR(2) |
| LAT_N | NUMBER |
| LAT_W | NUMBER |

**answer:**

```SELECT CITY
FROM STATION 
WHERE ID % 2 = 0
GROUP BY CITY;```

## Weather Observation Station 4

Find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.
The STATION table is described as follows:
    
| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| CITY | VARCHAR(21) |
| STATE | VARCHAR(2) |
| LAT_N | NUMBER |
| LAT_W | NUMBER |

where LAT_N is the northern latitude and LONG_W is the western longitude.

For example, if there are three records in the table with CITY values 'New York', 'New York', 'Bengalaru', there are 2 different city names: 'New York' and 'Bengalaru'. The query returns , because .

ANSWER:

```SELECT 
(COUNT(CITY)) - (COUNT(DISTINCT CITY))
FROM STATION```

## Weather Observation Station 5

Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.

The STATION table is described as follows:

| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| CITY | VARCHAR(21) |
| STATE | VARCHAR(2) |
| LAT_N | NUMBER |
| LAT_W | NUMBER |

where LAT_N is the northern latitude and LONG_W is the western longitude.

Sample Input

For example, CITY has four entries: DEF, ABC, PQRS and WXY.

Sample Output

```ABC 3```

```PQRS 4```

ANSWER:

```SELECT CITY,
LENGTH(CITY) AS LENGTHOFCITY
FROM STATION
ORDER BY LENGTHOFCITY ASC, CITY ASC
LIMIT 1;```

```SELECT CITY,
LENGTH(CITY) AS LENGTHOFCITY
FROM STATION
ORDER BY LENGTHOFCITY DESC, CITY ASC
LIMIT 1;```

## Weather Observation Station 6

Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows

The STATION table is described as follows:

| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| CITY | VARCHAR(21) |
| STATE | VARCHAR(2) |
| LAT_N | NUMBER |
| LAT_W | NUMBER |

where LAT_N is the northern latitude and LONG_W is the western longitude.

ANSWER:
    
```SELECT DISTINCT CITY
FROM STATION
WHERE CITY REGEXP '^[AEIOU]';```

## Weather Observation Station 7

Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:
    
| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| CITY | VARCHAR(21) |
| STATE | VARCHAR(2) |
| LAT_N | NUMBER |
| LAT_W | NUMBER |

where LAT_N is the northern latitude and LONG_W is the western longitude.

ANSWER:
    
SELECT DISTINCT CITY

FROM STATION

WHERE CITY REGEXP "[AEIOU]$";

## Weather Observation Station 8

Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:
    
| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| CITY | VARCHAR(21) |
| STATE | VARCHAR(2) |
| LAT_N | NUMBER |
| LAT_W | NUMBER |

where LAT_N is the northern latitude and LONG_W is the western longitude.

answer:

SELECT DISTINCT CITY

FROM STATION 

WHERE CITY REGEXP '^[AEIOU].*[AEIOU]$';

## Weather Observation Station 9

Query the list of CITY names from STATION that do not start with vowels. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:

| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| CITY | VARCHAR(21) |
| STATE | VARCHAR(2) |
| LAT_N | NUMBER |
| LAT_W | NUMBER |

where LAT_N is the northern latitude and LONG_W is the western longitude.

ANSWER:

```SELECT DISTINCT CITY
FROM STATION
WHERE CITY NOT REGEXP "^[AEIOU]";```

## Weather Observation Station 10

Query the list of CITY names from STATION that do not end with vowels. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:

| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| CITY | VARCHAR(21) |
| STATE | VARCHAR(2) |
| LAT_N | NUMBER |
| LAT_W | NUMBER |

where LAT_N is the northern latitude and LONG_W is the western longitude.

ANSWER:

```SELECT DISTINCT CITY
FROM STATION
WHERE CITY NOT REGEXP "[AEIOU]$;"```

## Weather Observation Station 11

Query the list of CITY names from STATION that either do not start with vowels or do not end with vowels. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:

| Field | Type |
| ----- | ----- |
| ID | NUMBER |
| CITY | VARCHAR(21) |
| STATE | VARCHAR(2) |
| LAT_N | NUMBER |
| LAT_W | NUMBER |

where LAT_N is the northern latitude and LONG_W is the western longitude.

ANSWER:

```SELECT DISTINCT CITY
FROM STATION
WHERE CITY NOT REGEXP "^[AEIOU].*[AEIOU]$";```

## Weather Observation Station 12

Query the list of CITY names from STATION that do not start with vowels and do not end with vowels. Your result cannot contain duplicates.

ANSWER:

```SELECT DISTINCT CITY
FROM STATION
WHERE CITY NOT REGEXP "^[AEIOU]"
AND CITY NOT REGEXP "[AEIOU]$";```

## Weather Observation Station 13

Query the sum of Northern Latitudes (LAT_N) from STATION having values greater than 38.7880 and less than 137.2345. Truncate your answer to 4 decimal places.

ANSWER:

```SELECT ROUND(SUM(LAT_N), 4)
FROM STATION
WHERE LAT_N > 38.7880
AND LAT_N < 137.2345;```

## Weather Observation Station 14

Query the greatest value of the Northern Latitudes (LAT_N) from STATION that is less than 137.2345. Truncate your answer to 4 decimal places.

ANSWER:

```SELECT ROUND(MAX(LAT_N), 4)
FROM STATION
WHERE LAT_N < 137.2345;```

## Weather Observation Station 15

Query the Western Longitude (LONG_W) for the largest Northern Latitude (LAT_N) in STATION that is less than 137.2345. Round your answer to 4 decimal places.

ANSWER:

```SELECT ROUND(LONG_W, 4)
FROM STATION
WHERE LAT_N < 137.2345
ORDER BY LAT_N DESC
LIMIT 1;```

## Weather Observation Station 16

Query the smallest Northern Latitude (LAT_N) from STATION that is greater than 38.7780. Round your answer to 4 decimal places.

ANSWER:

```SELECT ROUND(MIN(LAT_N), 4)
FROM STATION
WHERE LAT_N > 38.7780;```

## Weather Observation Station 17

Query the Western Longitude (LONG_W) where the smallest Northern Latitude (LAT_N) in STATION is greater than 38.7780. Round your answer to 4 decimal places.

ANSWER:

```SELECT ROUND(LONG_W, 4)
FROM STATION
WHERE LAT_N > 38.7780
ORDER BY LAT_N
LIMIT 1;```

## Higher Than 75 Marks

Query the Name of any student in STUDENTS who scored higher than  Marks. Order your output by the last three characters of each name. If two or more students both have names ending in the same last three characters (i.e.: Bobby, Robby, etc.), secondary sort them by ascending ID.

| Column | Type |
| ----- | ----- |
| ID | INTEGER |
|NAME | STRING |
|MARKS | INTEGER |

ANSWER:

```SELECT Name
FROM STUDENTS
WHERE Marks > 75
ORDER BY SUBSTRING(Name, -3, 3), ID;```

## Employee Names

Write a query that prints a list of employee names (i.e.: the name attribute) from the Employee table in alphabetical order.

Input Format

The Employee table containing employee data for a company is described as follows:

| COLUMN | TYPE |
|----- | ----- |
|employee_id | Integer |
| name | String |
|months | Integer |
|salary | Integer |

where employee_id is an employee's ID number, name is their name, months is the total number of months they've been working for the company, and salary is their monthly salary.

Answer:

``` SELECT name
FROM Employee
ORDER BY name;```

## Employee Salaries

Write a query that prints a list of employee names (i.e.: the name attribute) for employees in Employee having a salary greater than  per month who have been employees for less than  months. Sort your result by ascending employee_id.

ANSWER:

```SELECT name
FROM Employee
WHERE salary > 2000
AND months < 10;```

## Weather Observation Station 20

A median is defined as a number separating the higher half of a data set from the lower half. Query the median of the Northern Latitudes (LAT_N) from STATION and round your answer to 4 decimal places.

ANSWER:

```SET @rowindex := -1;```

```SELECT FORMAT(AVG(s.LAT_N), 4)
FROM 
(SELECT @rowindex:=@rowindex + 1 as rowindex,
STATION.LAT_N as LAT_N
FROM STATION
ORDER BY STATION.LAT_N)  as s
WHERE s.rowindex IN (FLOOR(@rowindex / 2), CEIL(@rowindex / 2));```

***Explanation:***
    
1. Let's Start with the Internal subquery:

```
SELECT @rowindex:=@rowindex + 1 as rowindex,
STATION.LAT_N as LAT_N
FROM STATION
ORDER BY STATION.LAT_N  as s```

- the subselect assigns @rowindex as an incremental index for each lat_n that is selected and sorts the lat_n

2. Once we have the sorted list of lat_n, the outer query will fetch the middle items in the array. If the array contains an odd number of items, both values will be the single middle value.

3. Then, the ```SELECT``` clause of the outer query returns the average of those 2 values as the median value.